Revit 2024 API
ElectricalDemandFactorValue.MaxRange Property
 The maximum range for this demand factor value. For example, objects 1 to 3 can have 100% demand factor. In the example above, the maximum range will be 3.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double MaxRange { get; set; }
Visual Basic
Public Property MaxRange As Double
	Get
	Set
Visual C++
public:
property double MaxRange {
	double get ();
	void set (double value);
}
See Also
ElectricalDemandFactorValue Class
Autodesk.Revit.DB.Electrical Namespace